dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/lib/cy_capsense_gesture_lib.c
/***************************************************************************//**
* \file cy_gesture.c
* \version 1.1
*
* \brief
*  Gesture implementation file.
*
********************************************************************************
* \copyright
* Copyright 2018, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_capsense_gesture_lib.h"


/*******************************************************************************
* Macro Definitions
*******************************************************************************/
/* 
* Rotate constants:
* U - Up        (0b00)
* D - Down      (0b01)
* D - Right     (0b10)
* L - Left      (0b11)
*/
/* Clockwise sequence */
#define CY_CAPSENSE_GESTURE_ROTATE_ORDER_U_R_D_L                    (0x27u)
#define CY_CAPSENSE_GESTURE_ROTATE_ORDER_L_U_R_D                    (0xC9u)
#define CY_CAPSENSE_GESTURE_ROTATE_ORDER_D_L_U_R                    (0x72u)
#define CY_CAPSENSE_GESTURE_ROTATE_ORDER_R_D_L_U                    (0x9Cu)

/* Counter clockwise sequence */
#define CY_CAPSENSE_GESTURE_ROTATE_ORDER_U_L_D_R                    (0x36u)
#define CY_CAPSENSE_GESTURE_ROTATE_ORDER_R_U_L_D                    (0x8Du)
#define CY_CAPSENSE_GESTURE_ROTATE_ORDER_D_R_U_L                    (0x63u)
#define CY_CAPSENSE_GESTURE_ROTATE_ORDER_L_D_R_U                    (0xD8u)

#define CY_CAPSENSE_GESTURE_ROTATE_LAST_DIRECTION_MASK              (0x03u)

/* Flick constants */
#define CY_CAPSENSE_TAN_22_5                                        (53u)
#define CY_CAPSENSE_TAN_67_5                                        (309u)
#define CY_CAPSENSE_TAN_BASE_SHIFT                                  (7u)

/* Constants for arctan calculation */
#define CY_CAPSENSE_GESTURE_ARCTAN_COEFF_A                          (54595)
#define CY_CAPSENSE_GESTURE_ARCTAN_COEFF_B                          (45066)
#define CY_CAPSENSE_GESTURE_ARCTAN_COEFF_C                          (47)

#define CY_CAPSENSE_GESTURE_DIRECTION_UNKNOWN                       (0xFFu)

#define ABS_DIFF(a,b)                                               (((a)>(b))?((a)-(b)):((b)-(a)))

#define CY_CAPSENSE_GESTURE_MULTIPLE_TOUCHES                        (0x04U)

/*******************************************************************************
* Gesture State Machine
*******************************************************************************/
#define CY_CAPSENSE_GESTURE_STATE_IDLE                              (0x00U)
#define CY_CAPSENSE_GESTURE_FIRST_TOUCH                             (0x01U)
#define CY_CAPSENSE_GESTURE_FIRST_LIFTOFF                           (0x02U)
#define CY_CAPSENSE_GESTURE_SECOND_TOUCH                            (0x03U)
#define CY_CAPSENSE_GESTURE_DETECTED                                (0x04U)
#define CY_CAPSENSE_GESTURE_INVALID                                 (0xFFU)


/*******************************************************************************
* Static Function Prototypes
*******************************************************************************/
static void Cy_CapSense_Gesture_Filtering(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context);
static void Cy_CapSense_Gesture_DecodeOneFgrSingleClick(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context);
static void Cy_CapSense_Gesture_DecodeOneFgrDoubleClick(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context);
static void Cy_CapSense_Gesture_DecodeOneFgrClickDrag(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context);
static void Cy_CapSense_Gesture_DecodeTwoFgrSingleClick(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context);
static void Cy_CapSense_Gesture_DecodeOneFgrScroll(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context);
static void Cy_CapSense_Gesture_DecodeTwoFgrScroll(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context);
static void Cy_CapSense_Gesture_DecodeOneFgrFlick(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context);
static void Cy_CapSense_Gesture_DecodeOneFgrEdgeSwipe(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context);
static void Cy_CapSense_Gesture_DecodeTwoFgrZoom(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context);
static void Cy_CapSense_Gesture_DecodeOneFgrRotate(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context);

static uint32_t Cy_CapSense_Gesture_DetermineQuadrant(
                uint16_t currX, uint16_t currY, 
                uint16_t prevX, uint16_t prevY);
static uint32_t Cy_CapSense_Gesture_DetermineEdge(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context);
static uint32_t Cy_CapSense_Gesture_CheckAngleWithinThresh(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context);
static uint32_t Cy_CapSense_Gesture_ArcTanOctant(uint32_t x, uint32_t y);
static int32_t Cy_CapSense_Gesture_GetAngle(uint32_t deltaX, uint32_t deltaY);
static uint32_t Cy_CapSense_Gesture_CheckDisplacement(
                uint32_t threshold,
                cy_stc_capsense_gesture_position_t * pos1,
                cy_stc_capsense_gesture_position_t * pos2);


