dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/lib/cy_capsense_gesture_lib.c
/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_ResetState
****************************************************************************//**
*
* Initializes internal variables and states.
*
* \param config
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
*******************************************************************************/
void Cy_CapSense_Gesture_ResetState(
                cy_stc_capsense_gesture_context_t * context)
{
    context->numPosition = 0U;
    context->numPositionLast = 0U;
    context->detected = 0u;
    context->direction = 0u;
    /* 
    * Init could happens when touch is on the panel. So, reseting gesture 
    * state machines to invalid state prevents false gesture detection 
    */
    context->ofscContext.state = CY_CAPSENSE_GESTURE_INVALID;
    context->ofdcContext.state = CY_CAPSENSE_GESTURE_INVALID;
    context->ofcdContext.state = CY_CAPSENSE_GESTURE_INVALID;
    context->tfscContext.state = CY_CAPSENSE_GESTURE_INVALID;
    context->ofslContext.state = CY_CAPSENSE_GESTURE_INVALID;
    context->tfslContext.state = CY_CAPSENSE_GESTURE_INVALID;
    context->offlContext.state = CY_CAPSENSE_GESTURE_INVALID;
    context->ofesContext.state = CY_CAPSENSE_GESTURE_INVALID;
    context->tfzmContext.state = CY_CAPSENSE_GESTURE_INVALID;
    context->ofrtContext.state = CY_CAPSENSE_GESTURE_INVALID;
}


/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_Decode
****************************************************************************//**
*
* Decodes all enabled gestures. This function is called each scanning cycle.
*
* \param timestamp
* Current timestamp.
*
* \param touchNumber
* The number of touches. Also this parameter defines the size of position array.
*
* \param position
* The pointer to the array of positions \ref cy_stc_capsense_gesture_position_t.
*
* \param config
* The pointer to the gesture configuration structure 
* \ref cy_stc_capsense_gesture_config_t.
*
* \param context
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
*******************************************************************************/
void Cy_CapSense_Gesture_Decode(
                uint32_t timestamp, 
                uint32_t touchNumber, 
                const cy_stc_capsense_gesture_position_t * position, 
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context)
{
    uint32_t gestureMask = config->gestureEnableMask;

    /* Reset report values */
    context->direction = 0u;
    context->detected = 0u;
    
    if ((CY_CAPSENSE_GESTURE_MULTIPLE_TOUCHES <= context->numPosition) ||
        (CY_CAPSENSE_GESTURE_MULTIPLE_TOUCHES <= context->numPositionLast))
    {
        /* Reset gesture state machines if multiple touches are detected */
        Cy_CapSense_Gesture_ResetState(context);
    }
    
    /* Preprocessing */
    context->timestamp = timestamp;
    context->numPosition = touchNumber;
    context->position1 = * position;
    context->position2 = *(position + 1u);
    
    /* Gesture decoding */
    if (0u != (gestureMask & CY_CAPSENSE_GESTURE_ONE_FNGR_SINGLE_CLICK_MASK)) 
    { 
        Cy_CapSense_Gesture_DecodeOneFgrSingleClick(config, context); 
    }
    if (0u != (gestureMask & CY_CAPSENSE_GESTURE_ONE_FNGR_DOUBLE_CLICK_MASK)) 
    { 
        Cy_CapSense_Gesture_DecodeOneFgrDoubleClick(config, context); 
    }
    if (0u != (gestureMask & CY_CAPSENSE_GESTURE_ONE_FNGR_CLICK_DRAG_MASK)) 
    { 
        Cy_CapSense_Gesture_DecodeOneFgrClickDrag(config, context); 
    }
    if (0u != (gestureMask & CY_CAPSENSE_GESTURE_TWO_FNGR_SINGLE_CLICK_MASK)) 
    { 
        Cy_CapSense_Gesture_DecodeTwoFgrSingleClick(config, context); 
    }
    if (0u != (gestureMask & CY_CAPSENSE_GESTURE_ONE_FNGR_SCROLL_MASK)) 
    { 
        Cy_CapSense_Gesture_DecodeOneFgrScroll(config, context); 
    }
    if (0u != (gestureMask & CY_CAPSENSE_GESTURE_TWO_FNGR_SCROLL_MASK)) 
    { 
        Cy_CapSense_Gesture_DecodeTwoFgrScroll(config, context); 
    }
    if (0u != (gestureMask & CY_CAPSENSE_GESTURE_ONE_FNGR_FLICK_MASK)) 
    { 
        Cy_CapSense_Gesture_DecodeOneFgrFlick(config, context); 
    }
    if (0u != (gestureMask & CY_CAPSENSE_GESTURE_ONE_FNGR_EDGE_SWIPE_MASK)) 
    { 
        Cy_CapSense_Gesture_DecodeOneFgrEdgeSwipe(config, context); 
    }
    if (0u != (gestureMask & CY_CAPSENSE_GESTURE_TWO_FNGR_ZOOM_MASK)) 
    { 
        Cy_CapSense_Gesture_DecodeTwoFgrZoom(config, context); 
    }
    if (0u != (gestureMask & CY_CAPSENSE_GESTURE_ONE_FNGR_ROTATE_MASK)) 
    { 
        Cy_CapSense_Gesture_DecodeOneFgrRotate(config, context); 
    }
    if (context->numPositionLast < context->numPosition)
    {
        context->detected |= CY_CAPSENSE_GESTURE_TOUCHDOWN_MASK;
    }
    if (context->numPositionLast > context->numPosition)
    {
        context->detected |= CY_CAPSENSE_GESTURE_LIFTOFF_MASK;
    }
    if (0u != (gestureMask & CY_CAPSENSE_GESTURE_FILTERING_MASK))
    {
        Cy_CapSense_Gesture_Filtering(config, context);
    }
    
    /* Post processing */
    context->numPositionLast = context->numPosition;
    context->positionLast1 = context->position1;
    context->positionLast2 = context->position2;
}


/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_Filtering
****************************************************************************//**
*
* Performs detected gesture filtering. The gesture priority defined as follow:
*   * most important
* * two-finger zoom
* * two-finger scroll
* * one-finger rotate
* * one-finger edge swipe
* * one-finger flick
* * one-finger scroll
* * two-finger single click
* * one-finger click and drag
* * one-finger double click
* * one-finger single click
* * touchdown
* * liftoff
*   * least important
*
* Some of gestures cannot be detected simultaneously.
*
* \param config
* The pointer to the gesture configuration structure 
* \ref cy_stc_capsense_gesture_config_t.
*
* \param context
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
*******************************************************************************/
static void Cy_CapSense_Gesture_Filtering(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context)
{
    uint32_t gesDetection = context->detected;
    
    /* Filter gesture if at least one gesture is detected */
    if (0u != (gesDetection & CY_CAPSENSE_GESTURE_ALL_GESTURES_MASK))
    {
        /* 
        * TWO-FINGER Group Priority:
        * - ZOOM
        * - SCROLL 
        */
        if (0u != (gesDetection & CY_CAPSENSE_GESTURE_TWO_FNGR_ZOOM_MASK))
        {
            gesDetection = CY_CAPSENSE_GESTURE_TWO_FNGR_ZOOM_MASK;
        }
        else if (0u != (gesDetection & CY_CAPSENSE_GESTURE_TWO_FNGR_SCROLL_MASK))
        {
            gesDetection = CY_CAPSENSE_GESTURE_TWO_FNGR_SCROLL_MASK;
        }
        /* 
        * ONE-FINGER Group Priority:
        * The descending order of strength conditions:
        * - ROTATE (x4 movement distance in correct order)
        * - EDGE (first touch location + movement distance + timeout)
        * - FLICK (movement distance + timeout)
        * - SCROLL (movement distance)
        */
        else if (0u != (gesDetection & CY_CAPSENSE_GESTURE_ONE_FNGR_ROTATE_MASK))
        {
            gesDetection = CY_CAPSENSE_GESTURE_ONE_FNGR_ROTATE_MASK;
        }
        else if (0u != (gesDetection & CY_CAPSENSE_GESTURE_ONE_FNGR_EDGE_SWIPE_MASK))
        {
            gesDetection = CY_CAPSENSE_GESTURE_ONE_FNGR_EDGE_SWIPE_MASK;
        }
        else if (0u != (gesDetection & CY_CAPSENSE_GESTURE_ONE_FNGR_FLICK_MASK))
        {
            gesDetection = CY_CAPSENSE_GESTURE_ONE_FNGR_FLICK_MASK;
        }
        else if (0u != (gesDetection & CY_CAPSENSE_GESTURE_ONE_FNGR_SCROLL_MASK))
        {
            gesDetection = CY_CAPSENSE_GESTURE_ONE_FNGR_SCROLL_MASK;
        }
        /* 
        * Click Group Priority:
        * - DOUBLE CLICK overwrites SINGLE CLICK
        */
        else if (0u != (gesDetection & CY_CAPSENSE_GESTURE_TWO_FNGR_SINGLE_CLICK_MASK))
        {
            gesDetection = CY_CAPSENSE_GESTURE_TWO_FNGR_SINGLE_CLICK_MASK;
        }
        else if (0u != (gesDetection & CY_CAPSENSE_GESTURE_ONE_FNGR_CLICK_DRAG_MASK))
        {
            gesDetection = CY_CAPSENSE_GESTURE_ONE_FNGR_CLICK_DRAG_MASK;
        }
        else if (0u != (gesDetection & CY_CAPSENSE_GESTURE_ONE_FNGR_DOUBLE_CLICK_MASK))
        {
            gesDetection = CY_CAPSENSE_GESTURE_ONE_FNGR_DOUBLE_CLICK_MASK;
        }
        else if (0u != (gesDetection & CY_CAPSENSE_GESTURE_ONE_FNGR_SINGLE_CLICK_MASK))
        {
            gesDetection = CY_CAPSENSE_GESTURE_ONE_FNGR_SINGLE_CLICK_MASK;
        }
        else
        {
            gesDetection = CY_CAPSENSE_GESTURE_NO_GESTURE;
        }
        /* 
        * Action Priority:
        * TOUCHDOWN and LIFTOFF cannot be detected simultaneously and
        * are overwritten by any detected gesture.
        */
        context->detected = (uint32_t)gesDetection;
    }
}


