dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/lib/cy_capsense_gesture_lib.c
/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_DecodeOneFgrSingleClick
****************************************************************************//**
*
* Performs decoding of one-finger single click gesture. This function is called 
* each scanning cycle.
*
* \param config
* The pointer to the gesture configuration structure 
* \ref cy_stc_capsense_gesture_config_t.
*
* \param context
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
*******************************************************************************/
static void Cy_CapSense_Gesture_DecodeOneFgrSingleClick(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context)
{
    uint32_t duration;
    cy_stc_capsense_ofsc_context_t * cxt = &context->ofscContext;
    
    if (context->numPosition >= 2U)
    {
        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
    }
    else
    {
        switch(cxt->state)
        {
            case CY_CAPSENSE_GESTURE_STATE_IDLE:
                if (context->numPosition == 1u)
                {
                    cxt->touchStartTime1 = context->timestamp;
                    cxt->touchStartPosition1 = context->position1;
                    cxt->state = CY_CAPSENSE_GESTURE_FIRST_TOUCH;
                }
                break;
                
            case CY_CAPSENSE_GESTURE_FIRST_TOUCH:
                if (context->numPosition == 0u)
                {
                    /* There could be single click gesture. Check conditions. */
                    duration = context->timestamp - cxt->touchStartTime1;
                    if ((config->clickTimeoutMax >= duration) &&
                        (config->clickTimeoutMin <= duration) &&
                        (0u != Cy_CapSense_Gesture_CheckDisplacement(config->clickDistanceMax, 
                                                                    &context->positionLast1, 
                                                                    &cxt->touchStartPosition1)))
                    {
                        /* Single click meets all conditions */
                        context->detected |= CY_CAPSENSE_GESTURE_ONE_FNGR_SINGLE_CLICK_MASK;
                    }
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                break;
                
            case CY_CAPSENSE_GESTURE_INVALID:
                if (context->numPosition == 0u)
                {
                    /* No touches: Reset state */
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                break;

            default:
                cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                break;
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_DecodeOneFgrDoubleClick
****************************************************************************//**
*
* Performs decoding of one-finger double click gesture. This function is called 
* each scanning cycle.
*
* \param config
* The pointer to the gesture configuration structure 
* \ref cy_stc_capsense_gesture_config_t.
*
* \param context
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
*******************************************************************************/
static void Cy_CapSense_Gesture_DecodeOneFgrDoubleClick(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context)
{
    uint32_t duration;
    cy_stc_capsense_ofdc_context_t * cxt = &context->ofdcContext;
    
    if (context->numPosition >= 2U)
    {
        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
    }
    else
    {
        switch(cxt->state)
        {
            case CY_CAPSENSE_GESTURE_STATE_IDLE:
                if (context->numPosition == 1u)
                {
                    cxt->touchStartTime1 = context->timestamp;
                    cxt->touchStartPosition1 = context->position1;
                    cxt->state = CY_CAPSENSE_GESTURE_FIRST_TOUCH;
                }
                break;
                
            case CY_CAPSENSE_GESTURE_FIRST_TOUCH:
                if (context->numPosition == 0u)
                {
                    /* There could be single click gesture. Check conditions. */
                    duration = context->timestamp - cxt->touchStartTime1;
                    if ((config->clickTimeoutMax >= duration) &&
                        (config->clickTimeoutMin <= duration) &&
                        (0u != Cy_CapSense_Gesture_CheckDisplacement(config->clickDistanceMax, 
                                                                    &context->positionLast1, 
                                                                    &cxt->touchStartPosition1)))
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_FIRST_LIFTOFF;
                        cxt->touchStartPosition1 = context->positionLast1;
                        cxt->touchStartTime1 = context->timestamp;
                    }
                    else
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                    }
                }
                break;
                                
            case CY_CAPSENSE_GESTURE_FIRST_LIFTOFF:
                if (context->numPosition == 0u)
                {
                    duration = context->timestamp - cxt->touchStartTime1; /* Check second touch interval */
                    if (config->secondClickIntervalMax < duration)
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;   /* Timeout */
                    }
                }
                else
                {
                    /* Check conditions */
                    duration = context->timestamp - cxt->touchStartTime1;
                    if ((config->secondClickIntervalMax < duration) ||
                        (config->secondClickIntervalMin > duration) ||
                        (0u == Cy_CapSense_Gesture_CheckDisplacement(config->secondClickDistanceMax, 
                                                                    &context->position1, 
                                                                    &cxt->touchStartPosition1)))
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_FIRST_TOUCH;
                    }
                    else
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_SECOND_TOUCH;
                    }
                    cxt->touchStartTime1 = context->timestamp;
                    cxt->touchStartPosition1 = context->position1;
                }
                break;
                
