dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/lib/cy_capsense_gesture_lib.c
            case CY_CAPSENSE_GESTURE_SECOND_TOUCH:
                if (context->numPosition == 0u)
                {
                    /* There could be single click gesture. Check conditions. */
                    duration = context->timestamp - cxt->touchStartTime1;
                    if ((config->clickTimeoutMax >= duration) &&
                        (config->clickTimeoutMin <= duration) &&
                        (0u != Cy_CapSense_Gesture_CheckDisplacement(config->clickDistanceMax, 
                                                                    &context->positionLast1, 
                                                                    &cxt->touchStartPosition1)))
                    {
                        /* Double click meets all conditions */
                        context->detected |= CY_CAPSENSE_GESTURE_ONE_FNGR_DOUBLE_CLICK_MASK;
                    }
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                break;
                                
            case CY_CAPSENSE_GESTURE_INVALID:
                if (context->numPosition == 0u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                break;

            default:
                cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                break;
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_DecodeOneFgrClickDrag
****************************************************************************//**
*
* Performs decoding of one-finger click and drag gesture. This function is 
* called each scanning cycle.
*
* \param config
* The pointer to the gesture configuration structure 
* \ref cy_stc_capsense_gesture_config_t.
*
* \param context
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
*******************************************************************************/
static void Cy_CapSense_Gesture_DecodeOneFgrClickDrag(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context)
{
    uint32_t duration;
    cy_stc_capsense_ofcd_context_t * cxt = &context->ofcdContext;
    
    if (context->numPosition >= 2U)
    {
        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
    }
    else
    {
        switch(cxt->state)
        {
            case CY_CAPSENSE_GESTURE_STATE_IDLE:
                if (context->numPosition == 1u)
                {
                    cxt->touchStartTime1 = context->timestamp;
                    cxt->touchStartPosition1 = context->position1;
                    cxt->state = CY_CAPSENSE_GESTURE_FIRST_TOUCH;
                }
                break;
                
            case CY_CAPSENSE_GESTURE_FIRST_TOUCH:
                if (context->numPosition == 0u)
                {
                    duration = context->timestamp - cxt->touchStartTime1;
                    if ((config->clickTimeoutMax >= duration) &&
                        (config->clickTimeoutMin <= duration) &&
                        (0u != Cy_CapSense_Gesture_CheckDisplacement(config->clickDistanceMax, 
                                                                    &context->positionLast1, 
                                                                    &cxt->touchStartPosition1)))
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_FIRST_LIFTOFF;
                        context->positionLast1 = cxt->touchStartPosition1;
                        cxt->touchStartTime1 = context->timestamp;
                    }
                    else
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                    }
                }
                break;
                                
            case CY_CAPSENSE_GESTURE_FIRST_LIFTOFF:
                if (context->numPosition == 0u)
                {
                    /* Check if timing is still valid */
                    duration = context->timestamp - cxt->touchStartTime1;
                    if (config->clickTimeoutMax < duration)
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                    }
                }
                else
                {
                    duration = context->timestamp - cxt->touchStartTime1;
                    if ((config->secondClickIntervalMax < duration) ||
                        (config->secondClickIntervalMin > duration) ||
                        (0u == Cy_CapSense_Gesture_CheckDisplacement(config->secondClickDistanceMax, 
                                                                    &context->position1, 
                                                                    &cxt->touchStartPosition1)))
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_FIRST_TOUCH;
                    }
                    else
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_SECOND_TOUCH;
                    }
                    cxt->touchStartTime1 = context->timestamp;
                    cxt->touchStartPosition1 = context->position1;
                }
                break;
                
            case CY_CAPSENSE_GESTURE_SECOND_TOUCH:
                if (context->numPosition == 0u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_FIRST_LIFTOFF;
                    context->positionLast1 = cxt->touchStartPosition1;
                    cxt->touchStartTime1 = context->timestamp;
                }
                else
                {
                    if (0u == Cy_CapSense_Gesture_CheckDisplacement(config->clickDistanceMax, 
                                                                    &context->position1, 
                                                                    &cxt->touchStartPosition1))
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_DETECTED;
                        context->detected |= CY_CAPSENSE_GESTURE_ONE_FNGR_CLICK_DRAG_MASK;
                    }
                }
                break;
                                
