dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/lib/cy_capsense_gesture_lib.c
            case CY_CAPSENSE_GESTURE_DETECTED:
                if (context->numPosition == 0u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                else
                {
                    context->detected |= CY_CAPSENSE_GESTURE_ONE_FNGR_CLICK_DRAG_MASK;
                }
                break;
                
            case CY_CAPSENSE_GESTURE_INVALID:
                if (context->numPosition == 0u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;   /* No touches: Reset state */
                }
                break;

            default:
                cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                break;
        }
    }
}


/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_DecodeTwoFgrSingleClick
****************************************************************************//**
*
* Performs decoding of two-finger click and drag gesture. This function is 
* called each scanning cycle.
*
* \param config
* The pointer to the gesture configuration structure 
* \ref cy_stc_capsense_gesture_config_t.
*
* \param context
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
*******************************************************************************/
static void Cy_CapSense_Gesture_DecodeTwoFgrSingleClick(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context)
{
    uint32_t duration;
    cy_stc_capsense_tfsc_context_t * cxt = &context->tfscContext;
    
    if (context->numPosition >= 3U)
    {
        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
    }
    else
    {
        switch(cxt->state)
        {
            case CY_CAPSENSE_GESTURE_STATE_IDLE:
                if (context->numPosition >= 1u)
                {
                    cxt->touchStartTime1 = context->timestamp;
                    cxt->touchStartPosition1 = context->position1;
                    cxt->state = CY_CAPSENSE_GESTURE_FIRST_TOUCH;
                } 
                if (context->numPosition >= 2u)
                {
                    cxt->touchStartTime2 = context->timestamp;
                    cxt->touchStartPosition2 = context->position2;
                    cxt->state = CY_CAPSENSE_GESTURE_SECOND_TOUCH;
                }
                break;
                
            case CY_CAPSENSE_GESTURE_FIRST_TOUCH:
                if (context->numPosition == 0u) 
                {
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                else if (context->numPosition == 1u)
                {
                    /* Track timeouts and touch displacement to be sure that it meets conditions all the time */
                    duration = context->timestamp - cxt->touchStartTime1;
                    if (config->clickTimeoutMax < duration)
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                    }
                }
                else if (context->numPosition == 2u)
                {
                    /* Track timeouts and touch displacement to be sure that it meets conditions all the time */
                    duration = context->timestamp - cxt->touchStartTime1;
                    if (config->clickTimeoutMax < duration)
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                    } 
                    else
                    {
                        cxt->touchStartPosition1 = context->position1;
                        cxt->touchStartPosition2 = context->position2;
                        cxt->touchStartTime2 = context->timestamp;
                        cxt->state = CY_CAPSENSE_GESTURE_SECOND_TOUCH;
                    }
                }
                else /* (context->numPosition >= 3U) */
                {
                    cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                }

                break;
            case CY_CAPSENSE_GESTURE_SECOND_TOUCH:
                if (context->numPosition == 0u)
                {
                    duration = context->timestamp - cxt->touchStartTime1;
                    if ((config->clickTimeoutMax < duration) ||
                        (config->clickTimeoutMin > duration) ||
                        (0u == Cy_CapSense_Gesture_CheckDisplacement(config->clickDistanceMax, 
                                                                    &context->positionLast1, 
                                                                    &cxt->touchStartPosition1)))
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                    }
                    duration = context->timestamp - cxt->touchStartTime2;
                    if ((config->clickTimeoutMax < duration) ||
                        (config->clickTimeoutMin > duration) ||
                        (0u == Cy_CapSense_Gesture_CheckDisplacement(config->clickDistanceMax, 
                                                                    &context->positionLast2, 
                                                                    &cxt->touchStartPosition2)))
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                    }
                    if (cxt->state == CY_CAPSENSE_GESTURE_SECOND_TOUCH)
                    {
                        context->detected |= CY_CAPSENSE_GESTURE_TWO_FNGR_SINGLE_CLICK_MASK;
                    }
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                else if (context->numPosition == 1u)
                {
                    /* Track timeouts and touch displacement to be sure that it meets conditions all the time */
                    duration = context->timestamp - cxt->touchStartTime1;
                    if (config->clickTimeoutMax < duration)
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                    }
                    else
                    {
                        cxt->touchStartPosition1 = context->position1;
                        cxt->state = CY_CAPSENSE_GESTURE_FIRST_LIFTOFF;
                    }
                }
                else if (context->numPosition == 2u)
                {
                    /* Track timeouts and touch displacement to be sure that it meets conditions all the time */
                    duration = context->timestamp - cxt->touchStartTime1;
                    if ((config->clickTimeoutMax < duration) ||
                        (0u == Cy_CapSense_Gesture_CheckDisplacement(config->clickDistanceMax, 
                                                                    &context->position1, 
                                                                    &cxt->touchStartPosition1)))
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                    } 
                    duration = context->timestamp - cxt->touchStartTime2;
                    if ((config->clickTimeoutMax < duration) ||
                        (0u == Cy_CapSense_Gesture_CheckDisplacement(config->clickDistanceMax, 
                                                                    &context->position2, 
                                                                    &cxt->touchStartPosition2)))
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                    } 
                }
                else /* (context->numPosition >= 3U) */
                {
                    cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                }
                break;
                
            case CY_CAPSENSE_GESTURE_FIRST_LIFTOFF:
                if (context->numPosition == 0u)
                {
                    duration = context->timestamp - cxt->touchStartTime1;
                    if ((config->clickTimeoutMax >= duration) &&
                        (config->clickTimeoutMin <= duration) &&
                        (0u != Cy_CapSense_Gesture_CheckDisplacement(config->clickDistanceMax, 
                                                                    &context->positionLast1, 
                                                                    &cxt->touchStartPosition1)))
                    {
                        context->detected |= CY_CAPSENSE_GESTURE_TWO_FNGR_SINGLE_CLICK_MASK;
                    }
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                else if (context->numPosition == 1u)
                {
                    /* Track timeouts and touch displacement to be sure that it meets conditions all the time */
                    duration = context->timestamp - cxt->touchStartTime1;
                    if (config->clickTimeoutMax < duration)
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                    }
                }
                else if (context->numPosition == 2u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                }
                else /* (context->numPosition >= 3U) */
                {
                    cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                }
                break;
                
            case CY_CAPSENSE_GESTURE_INVALID:
                if (context->numPosition == 0u)
                {
                    /* No touches: Reset state */
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                break;

            default:
                cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                break;
        }
    }
}


