dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/lib/cy_capsense_gesture_lib.c
/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_DecodeOneFgrScroll
****************************************************************************//**
*
* Performs decoding of one-finger scroll gesture. This function is 
* called each scanning cycle.
*
* \param config
* The pointer to the gesture configuration structure 
* \ref cy_stc_capsense_gesture_config_t.
*
* \param context
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
*******************************************************************************/
static void Cy_CapSense_Gesture_DecodeOneFgrScroll(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context)
{
    uint32_t delta;
    uint32_t direction;
    cy_stc_capsense_ofsl_context_t * cxt = &context->ofslContext;

    switch(cxt->state)
    {
        case CY_CAPSENSE_GESTURE_STATE_IDLE:
            if (context->numPosition == 1u)
            {
                cxt->touchStartPosition1 = context->position1;
                cxt->debounce = config->scrollDebounce;
                cxt->direction = CY_CAPSENSE_GESTURE_DIRECTION_UNKNOWN;
                cxt->state = CY_CAPSENSE_GESTURE_FIRST_TOUCH;
            }
            break;
            
        case CY_CAPSENSE_GESTURE_FIRST_TOUCH:
            if (context->numPosition == 0u)
            {
                cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
            }
            else if (context->numPosition == 1u)
            {
                /* Determine direction */
                direction = Cy_CapSense_Gesture_DetermineQuadrant(context->position1.x, context->position1.y,
                                                           cxt->touchStartPosition1.x, cxt->touchStartPosition1.y);

                if ((CY_CAPSENSE_GESTURE_DIRECTION_UP == direction) || (CY_CAPSENSE_GESTURE_DIRECTION_DOWN == direction))
                {
                    delta = ABS_DIFF(context->position1.y, cxt->touchStartPosition1.y);
                }
                else
                {
                    delta = ABS_DIFF(context->position1.x, cxt->touchStartPosition1.x);
                }
                
                /* An activity is detected */
                if (delta >= config->scrollDistanceMin)
                {
                    /* If it is new direction then reset debounce counter */
                    if (cxt->direction != direction)
                    {
                        cxt->debounce = config->scrollDebounce;
                        cxt->direction = direction;
                    }
                    
                    if (cxt->debounce != 0u)
                    {
                        cxt->debounce--;
                    }

                    if (0u == cxt->debounce)
                    {
                        context->detected |= CY_CAPSENSE_GESTURE_ONE_FNGR_SCROLL_MASK;
                        context->direction |= direction << CY_CAPSENSE_GESTURE_DIRECTION_OFFSET_ONE_SCROLL;
                    }
                }
                cxt->touchStartPosition1 = context->position1;
            }
            else
            {
                cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
            }
            
            break;

        default:
            cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
            break;
    }
}

/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_DecodeTwoFgrScroll
****************************************************************************//**
*
* Performs decoding of two-finger scroll gesture. This function is 
* called each scanning cycle.
*
* \param config
* The pointer to the gesture configuration structure 
* \ref cy_stc_capsense_gesture_config_t.
*
* \param context
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
*******************************************************************************/
static void Cy_CapSense_Gesture_DecodeTwoFgrScroll(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context)
{
    uint32_t delta;
    uint32_t direction1;
    uint32_t direction2;
    uint32_t touchCenter;
    uint32_t touchCenterPrev;
    cy_stc_capsense_tfsl_context_t * cxt = &context->tfslContext;

    switch(cxt->state)
    {
        case CY_CAPSENSE_GESTURE_STATE_IDLE:
            if (context->numPosition == 2u)
            {
                cxt->touchStartPosition1 = context->position1;
                cxt->touchStartPosition2 = context->position2;
                cxt->debounce = config->scrollDebounce;
                cxt->direction = CY_CAPSENSE_GESTURE_DIRECTION_UNKNOWN;
                cxt->state = CY_CAPSENSE_GESTURE_SECOND_TOUCH;
            }

            break;
            
        case CY_CAPSENSE_GESTURE_SECOND_TOUCH:
            if (context->numPosition == 2u)
            {
                /* Determine direction */
                direction1 = Cy_CapSense_Gesture_DetermineQuadrant(context->position1.x, context->position1.y,
                                                           cxt->touchStartPosition1.x, cxt->touchStartPosition1.y);
                direction2 = Cy_CapSense_Gesture_DetermineQuadrant(context->position2.x, context->position2.y,
                                                           cxt->touchStartPosition2.x, cxt->touchStartPosition2.y);
                
                if (direction1 == direction2)
                {
                    if ((CY_CAPSENSE_GESTURE_DIRECTION_UP == direction1) || (CY_CAPSENSE_GESTURE_DIRECTION_DOWN == direction1))
                    {
                        touchCenter = (context->position1.y + context->position2.y) >> 1u;
                        touchCenterPrev = (cxt->touchStartPosition1.y + cxt->touchStartPosition2.y) >> 1u;
                    }
                    else
                    {
                        touchCenter = (context->position1.x + context->position2.x) >> 1u;
                        touchCenterPrev = (cxt->touchStartPosition1.x + cxt->touchStartPosition2.x) >> 1u;
                    }
                    delta = ABS_DIFF(touchCenter, touchCenterPrev);
                    
                    /* An activity is detected */
                    if (delta >= config->scrollDistanceMin)
                    {
                        /* If it is new direction then reset debounce counter */
                        if (cxt->direction != direction1)
                        {
                            cxt->debounce = config->scrollDebounce;
                            cxt->direction = direction1;
                        }
                        
                        if (cxt->debounce != 0u)
                        {
                            cxt->debounce--;
                        }

                        if (0u == cxt->debounce)
                        {
                            context->detected |= CY_CAPSENSE_GESTURE_TWO_FNGR_SCROLL_MASK;
                            context->direction |= direction1 << CY_CAPSENSE_GESTURE_DIRECTION_OFFSET_TWO_SCROLL;
                        }
                    }
                }
                cxt->touchStartPosition1 = context->position1;
                cxt->touchStartPosition2 = context->position2;
            }
            else
            {
                cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
            }
            
            break;

        default:
            cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
            break;
    }
}

