dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/lib/cy_capsense_gesture_lib.c
/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_DecodeOneFgrFlick
****************************************************************************//**
*
* Performs decoding of one-finger flick gesture. This function is 
* called each scanning cycle.
*
* \param config
* The pointer to the gesture configuration structure 
* \ref cy_stc_capsense_gesture_config_t.
*
* \param context
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
*******************************************************************************/
static void Cy_CapSense_Gesture_DecodeOneFgrFlick(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context)
{
    uint32_t duration;
    uint32_t displacementX;
    uint32_t displacementY;
    uint32_t gestureDirection;
    cy_stc_capsense_offl_context_t * cxt = &context->offlContext;
    
    if (context->numPosition >= 2U)
    {
        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
    }
    else
    {
        switch(cxt->state)
        {
            case CY_CAPSENSE_GESTURE_STATE_IDLE:
                if (context->numPosition == 1u)
                {
                    cxt->touchStartTime1 = context->timestamp;
                    cxt->touchStartPosition1 = context->position1;
                    cxt->state = CY_CAPSENSE_GESTURE_FIRST_TOUCH;
                }
                break;
                
            case CY_CAPSENSE_GESTURE_FIRST_TOUCH:
                if (context->numPosition == 0u)
                {
                    /* Check conditions */
                    duration = context->timestamp - cxt->touchStartTime1;
                    displacementX = ABS_DIFF(context->positionLast1.x, cxt->touchStartPosition1.x);
                    displacementY = ABS_DIFF(context->positionLast1.y, cxt->touchStartPosition1.y);
                    if ((config->flickTimeoutMax >= duration) &&
                        ((config->flickDistanceMin <= displacementX) ||
                         (config->flickDistanceMin <= displacementY)))
                    {
                        displacementY <<= CY_CAPSENSE_TAN_BASE_SHIFT;
                        /* Find direction */
                        if (displacementY <= (displacementX * CY_CAPSENSE_TAN_22_5))
                        {
                            if (context->positionLast1.x > cxt->touchStartPosition1.x)
                            {
                                gestureDirection = CY_CAPSENSE_GESTURE_DIRECTION_RIGHT;
                            }
                            else
                            {
                                gestureDirection = CY_CAPSENSE_GESTURE_DIRECTION_LEFT;
                            }
                        }
                        else if (displacementY > (displacementX * CY_CAPSENSE_TAN_67_5))
                        {
                            if (context->positionLast1.y > cxt->touchStartPosition1.y)
                            {
                                gestureDirection = CY_CAPSENSE_GESTURE_DIRECTION_UP;
                            }
                            else
                            {
                                gestureDirection = CY_CAPSENSE_GESTURE_DIRECTION_DOWN;
                            }
                        }
                        else
                        {
                            if (context->positionLast1.x >= cxt->touchStartPosition1.x)
                            {
                                if (context->positionLast1.y >= cxt->touchStartPosition1.y)
                                {
                                    gestureDirection = CY_CAPSENSE_GESTURE_DIRECTION_UP_RIGHT;    
                                }
                                else
                                {
                                    gestureDirection = CY_CAPSENSE_GESTURE_DIRECTION_DOWN_RIGHT;    
                                }
                            }
                            else 
                            {
                                if (context->positionLast1.y >= cxt->touchStartPosition1.y)
                                {
                                    gestureDirection = CY_CAPSENSE_GESTURE_DIRECTION_UP_LEFT;    
                                }
                                else
                                {
                                    gestureDirection = CY_CAPSENSE_GESTURE_DIRECTION_DOWN_LEFT;    
                                }
                            }
                        }
                        context->detected |= CY_CAPSENSE_GESTURE_ONE_FNGR_FLICK_MASK;
                        context->direction |= gestureDirection << CY_CAPSENSE_GESTURE_DIRECTION_OFFSET_ONE_FLICK;
                    }
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                else
                {
                    /* Track timeouts to be sure that gesture meets conditions all the time */
                    duration = context->timestamp - cxt->touchStartTime1;
                    if (config->flickTimeoutMax < duration)
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                    }
                }
                break;
                                
            case CY_CAPSENSE_GESTURE_INVALID:
                if (context->numPosition == 0u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;   /* No touches: Reset state */
                }
                break;

            default:
                cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                break;
        }
    }
}

/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_DecodeOneFgrEdgeSwipe
****************************************************************************//**
*
* Performs decoding of one-finger edge swipe gesture. This function is 
* called each scanning cycle.
*
* \param config
* The pointer to the gesture configuration structure 
* \ref cy_stc_capsense_gesture_config_t.
*
* \param context
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
*******************************************************************************/
static void Cy_CapSense_Gesture_DecodeOneFgrEdgeSwipe(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context)
{
    uint32_t duration;
    uint32_t angle;
    cy_stc_capsense_ofes_context_t * cxt = &context->ofesContext;
    
    if (context->numPosition >= 2u)
    {
        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
    }
    else
    {
        switch(cxt->state)
        {
            case CY_CAPSENSE_GESTURE_STATE_IDLE:
                if (context->numPosition == 1u)
                {
                    cxt->touchStartTime1 = context->timestamp;
                    cxt->touchStartPosition1 = context->position1;
                    
