dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/lib/cy_capsense_gesture_lib.c
                    /* Get an edge */
                    cxt->edge = Cy_CapSense_Gesture_DetermineEdge(config, context);
                    if (CY_CAPSENSE_GESTURE_DIRECTION_UNKNOWN == cxt->edge)
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                    }
                    else
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_FIRST_TOUCH;
                    }
                }
                break;
                
            case CY_CAPSENSE_GESTURE_FIRST_TOUCH:
                if (context->numPosition == 0u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                else
                {
                    /* Check timeout */
                    duration = context->timestamp - cxt->touchStartTime1;
                    if (duration > config->edgeTimeoutMax)
                    {
                        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                    }
                    else
                    {
                        angle = Cy_CapSense_Gesture_CheckAngleWithinThresh(config, context);
                        /* Angle and displacement verification */
                        if (CY_CAPSENSE_GESTURE_DIRECTION_UNKNOWN == angle)
                        {
                            cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                        }
                        else if (0u != angle)
                        {
                            cxt->state = CY_CAPSENSE_GESTURE_DETECTED;
                            context->detected |= CY_CAPSENSE_GESTURE_ONE_FNGR_EDGE_SWIPE_MASK;
                            context->direction |= cxt->edge << CY_CAPSENSE_GESTURE_DIRECTION_OFFSET_ONE_EDGE;
                        }
                    }
                }
                break;
                                
            case CY_CAPSENSE_GESTURE_DETECTED:
                if (context->numPosition == 0u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                break;
                
            case CY_CAPSENSE_GESTURE_INVALID:
                if (context->numPosition == 0u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;   /* No touches: Reset state */
                }
                break;

            default:
                cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                break;
        }
    }
}

/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_DecodeTwoFgrZoom
****************************************************************************//**
*
* Performs decoding of two-finger zoom gesture. This function is 
* called each scanning cycle.
*
* \param config
* The pointer to the gesture configuration structure 
* \ref cy_stc_capsense_gesture_config_t.
*
* \param context
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
*******************************************************************************/
static void Cy_CapSense_Gesture_DecodeTwoFgrZoom(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context)
{
    int16_t displacementX;
    int16_t displacementY;
    int16_t deltaX;
    int16_t deltaY;
    uint32_t gestureDirection = CY_CAPSENSE_GESTURE_DIRECTION_UNKNOWN;
    cy_stc_capsense_tfzm_context_t * cxt = &context->tfzmContext;
    
    if (context->numPosition >= 3U)
    {
        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
    }
    else
    {
        switch(cxt->state)
        {
            case CY_CAPSENSE_GESTURE_STATE_IDLE:
                if (context->numPosition >= 1u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_FIRST_TOUCH;
                } 
                if (context->numPosition >= 2u)
                {
                    cxt->touchStartPosition1 = context->position1;
                    cxt->touchStartPosition2 = context->position2;
                    cxt->distanceX = ABS_DIFF(context->position1.x, context->position2.x);
                    cxt->distanceY = ABS_DIFF(context->position1.y, context->position2.y);
                    cxt->state = CY_CAPSENSE_GESTURE_SECOND_TOUCH;
                    cxt->debounce = config->zoomDebounce;
                }
                break;
                
            case CY_CAPSENSE_GESTURE_FIRST_TOUCH:
                if (context->numPosition == 0u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                else if (context->numPosition == 2u)
                {
                    cxt->touchStartPosition1 = context->position1;
                    cxt->touchStartPosition2 = context->position2;
                    cxt->distanceX = ABS_DIFF(context->position1.x, context->position2.x);
                    cxt->distanceY = ABS_DIFF(context->position1.y, context->position2.y);
                    cxt->state = CY_CAPSENSE_GESTURE_SECOND_TOUCH;
                    cxt->debounce = config->zoomDebounce;
                }
                else
                {
                    /* Do not change state when numPosition == 1u */
                }
                break;
            case CY_CAPSENSE_GESTURE_SECOND_TOUCH:
                if (context->numPosition == 0u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                else if (context->numPosition == 1u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_FIRST_TOUCH;
                }
                else if (context->numPosition == 2u)
                {
                    /* Calculate current distance between touches */
                    displacementX = ABS_DIFF(context->position1.x, context->position2.x);
                    displacementY = ABS_DIFF(context->position1.y, context->position2.y);
                    
