dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/lib/cy_capsense_gesture_lib.c
                    /* Getting deltas */
                    deltaX = displacementX - (int16_t)cxt->distanceX;
                    deltaY = displacementY - (int16_t)cxt->distanceY;
                    
                    /* Check if deltas pass zoom active distances */
                    if ((deltaX > config->zoomDistanceMin) ||
                        (deltaY > config->zoomDistanceMin))
                    {
                        gestureDirection = CY_CAPSENSE_GESTURE_DIRECTION_IN;
                    } 
                    else if (deltaX < 0)
                    {
                        if (-deltaX > config->zoomDistanceMin)
                        {
                            gestureDirection = CY_CAPSENSE_GESTURE_DIRECTION_OUT;
                        }
                    }
                    else if (deltaY < 0)
                    {
                        if (-deltaY > config->zoomDistanceMin)
                        {
                            gestureDirection = CY_CAPSENSE_GESTURE_DIRECTION_OUT;
                        }
                    }
                    else
                    {
                        gestureDirection = CY_CAPSENSE_GESTURE_DIRECTION_UNKNOWN;
                    }
                    
                    if (CY_CAPSENSE_GESTURE_DIRECTION_UNKNOWN != gestureDirection)
                    {
                        cxt->distanceX = displacementX;
                        cxt->distanceY = displacementY;
                        /* Check timeout */
                        if (0u != config->zoomDebounce)
                        {
                            if (cxt->debounce > 0u)
                            {
                                cxt->debounce--;
                            }
                            if (cxt->debounce == 0u)
                            {
                                context->detected |= CY_CAPSENSE_GESTURE_TWO_FNGR_ZOOM_MASK;
                                context->direction |= (uint16_t)(gestureDirection << CY_CAPSENSE_GESTURE_DIRECTION_OFFSET_TWO_ZOOM);
                            }
                        }
                    }
                }
                else /* (context->numPosition >= 3U) */
                {
                    cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                }
                
                break;
                
            case CY_CAPSENSE_GESTURE_INVALID:
                if (context->numPosition == 0u)
                {
                    /* No touches: Reset state */
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                break;

            default:
                cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                break;
        }
    }
}

/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_DecodeOneFgrRotate
****************************************************************************//**
*
* Performs decoding of one-finger rotate gesture. This function is 
* called each scanning cycle.
*
* \param config
* The pointer to the gesture configuration structure 
* \ref cy_stc_capsense_gesture_config_t.
*
* \param context
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
*******************************************************************************/
static void Cy_CapSense_Gesture_DecodeOneFgrRotate(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context)
{
    uint32_t displacementX;
    uint32_t displacementY;
    uint32_t direction;
    uint32_t rotateHistory;
    cy_stc_capsense_ofrt_context_t * cxt = &context->ofrtContext;
    
    if (context->numPosition >= 2u)
    {
        cxt->state = CY_CAPSENSE_GESTURE_INVALID;
    }
    else
    {
        switch(cxt->state)
        {
            case CY_CAPSENSE_GESTURE_STATE_IDLE:
                if (context->numPosition == 1u)
                {
                    cxt->touchStartPosition1 = context->position1;
                    cxt->state = CY_CAPSENSE_GESTURE_FIRST_TOUCH;
                    cxt->debounce = config->rotateDebounce;
                    cxt->history = 0u;
                }
                break;
                
            case CY_CAPSENSE_GESTURE_FIRST_TOUCH:
                if (context->numPosition == 0u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                }
                else
                {
                    displacementX = ABS_DIFF(context->position1.x, cxt->touchStartPosition1.x);
                    displacementY = ABS_DIFF(context->position1.y, cxt->touchStartPosition1.y);
                    
                    /* Check displacement */
                    if ((config->rotateDistanceMin <= displacementX) ||
                        (config->rotateDistanceMin <= displacementY))
                    {
                        /* Determine direction */
                        direction = Cy_CapSense_Gesture_DetermineQuadrant(context->position1.x, context->position1.y,
                                                                   cxt->touchStartPosition1.x, cxt->touchStartPosition1.y);
                        
                        /* Special case for empty history. Force a non-sequential set until 4 values are read */
                        rotateHistory = cxt->history;
                        if (0u == rotateHistory)
                        {
                            rotateHistory = direction + 2u;
                        }
                        /* New direction */
                        if (direction != (rotateHistory & CY_CAPSENSE_GESTURE_ROTATE_LAST_DIRECTION_MASK))
                        {
                            cxt->debounce = config->rotateDebounce;
                            /* Keep history updated */
                            rotateHistory = (uint8_t)((rotateHistory << 2u) | direction);
                            cxt->history = (uint8_t)rotateHistory;
                            /* Determine gesture code */
                            if ((rotateHistory == CY_CAPSENSE_GESTURE_ROTATE_ORDER_U_R_D_L) ||
                                (rotateHistory == CY_CAPSENSE_GESTURE_ROTATE_ORDER_L_U_R_D) ||
                                (rotateHistory == CY_CAPSENSE_GESTURE_ROTATE_ORDER_D_L_U_R) ||
                                (rotateHistory == CY_CAPSENSE_GESTURE_ROTATE_ORDER_R_D_L_U))
                            {
                                context->detected |= CY_CAPSENSE_GESTURE_ONE_FNGR_ROTATE_MASK;
                                context->direction |= (CY_CAPSENSE_GESTURE_DIRECTION_CW << CY_CAPSENSE_GESTURE_DIRECTION_OFFSET_ONE_ROTATE);
                            }
                            else if ((rotateHistory == CY_CAPSENSE_GESTURE_ROTATE_ORDER_U_L_D_R) ||
                                     (rotateHistory == CY_CAPSENSE_GESTURE_ROTATE_ORDER_R_U_L_D) ||
                                     (rotateHistory == CY_CAPSENSE_GESTURE_ROTATE_ORDER_D_R_U_L) ||
                                     (rotateHistory == CY_CAPSENSE_GESTURE_ROTATE_ORDER_L_D_R_U))
                            {
                                context->detected |= CY_CAPSENSE_GESTURE_ONE_FNGR_ROTATE_MASK;
                                context->direction |= (CY_CAPSENSE_GESTURE_DIRECTION_CCW << CY_CAPSENSE_GESTURE_DIRECTION_OFFSET_ONE_ROTATE);
                            }
                            else
                            {
                                /* Gesture is not detected. Detection status cleared commonly on upper level */
                            }
                        }
                        else
                        {
                            /* The same direction. Check debounce */
                            if (0u != config->rotateDebounce)
                            {
                                if (0u != cxt->debounce)
                                {
                                    cxt->debounce--;    
                                }
                                else
                                {
                                    /* Number of motion in the same direction exceeded */
                                    cxt->state = CY_CAPSENSE_GESTURE_INVALID;
                                }
                            }
                        }
                        /* Update position */
                        cxt->touchStartPosition1 = context->position1;
                    }
                }
                break;
                                
            case CY_CAPSENSE_GESTURE_INVALID:
                if (context->numPosition == 0u)
                {
                    cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;   /* No touches: Reset state */
                }
                break;

            default:
                cxt->state = CY_CAPSENSE_GESTURE_STATE_IDLE;
                break;
        }
    }
}


