dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/lib/cy_capsense_gesture_lib.c
/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_DetermineQuadrant
****************************************************************************//**
*
* Determines directions.
*
* \param currX
* Current position X-axis.
*
* \param currY
* Current position Y-axis.
*
* \param prevX
* Previous position X-axis.
*
* \param prevY
* Previous position Y-axis.
*
* \return
* Returns direction either UP, DOWN, RIGHT or LEFT.
*
*******************************************************************************/
static uint32_t Cy_CapSense_Gesture_DetermineQuadrant(uint16_t currX, uint16_t currY, uint16_t prevX, uint16_t prevY)
{
    uint32_t quadrant;
    
    if ((ABS_DIFF(currX, prevX)) >= (ABS_DIFF(currY, prevY)))
    {
        if (currX >= prevX)
        {
            quadrant = CY_CAPSENSE_GESTURE_DIRECTION_RIGHT;
        }
        else
        {
            quadrant = CY_CAPSENSE_GESTURE_DIRECTION_LEFT;
        }
    }
    else
    {
        if (currY >= prevY)
        {
            quadrant = CY_CAPSENSE_GESTURE_DIRECTION_UP;
        }
        else
        {
            quadrant = CY_CAPSENSE_GESTURE_DIRECTION_DOWN;
        }
    }
    
    return (quadrant);
}


/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_DetermineEdge
****************************************************************************//**
*
* Determines direction of touch movement started on edge. If 
*
* \param config
* The pointer to the gesture configuration structure 
* \ref cy_stc_capsense_gesture_config_t.
*
* \param context
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
* \return
* Returns direction either UP, DOWN, RIGHT or LEFT. If movement started 
* not from an edge CY_CAPSENSE_GESTURE_DIRECTION_UNKNOWN is returned.
*
*******************************************************************************/
static uint32_t Cy_CapSense_Gesture_DetermineEdge(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context)
{
    uint32_t direction;
    uint32_t posX = context->position1.x;
    uint32_t posY = context->position1.y;
    uint32_t resX = config->resolutionX;
    uint32_t resY = config->resolutionY;
    uint32_t width = config->edgeEdgeSize;

    if ((posY >= width) && (posY < (resY - width)))
    {
        if (posX < width)
        {
            direction = CY_CAPSENSE_GESTURE_DIRECTION_RIGHT;
        }
        else if ((posX >= (resX - width)) && (posX <= resX))
        {
            direction = CY_CAPSENSE_GESTURE_DIRECTION_LEFT;
        }
        else
        {
            direction = CY_CAPSENSE_GESTURE_DIRECTION_UNKNOWN;
        }
    } 
    else if ((posX >= width) && (posX < (resX - width)))
    {
        if (posY < width)
        {
            direction = CY_CAPSENSE_GESTURE_DIRECTION_UP;
        }    
        else if ((posY >= (resY - width)) && (posY <= resY))
        {
            direction = CY_CAPSENSE_GESTURE_DIRECTION_DOWN;
        }
        else
        {
            direction = CY_CAPSENSE_GESTURE_DIRECTION_UNKNOWN;
        }
    }
    else
    {
        direction = CY_CAPSENSE_GESTURE_DIRECTION_UNKNOWN;
    }
    
    return direction;
}


/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_ArcTanOctant
****************************************************************************//**
*
* Calculates the angle associated with an X value and a Y value within the
* first octant of the coordinate plane (0 to 45 degrees). 
* Theory described in VASM#89.
* \note
*  1. Estimated error is +/-  90/127 degrees.
*
* \param x
* This value must be non-zero.  If it is zero, the result is undefined.
*
* \param y
* This value must be less than or equal to the value of x. If y
* is greater than x, the returned value is undefined.
*
* \return
* Angle in counts ranging from 0 to 64.  Each count represents an increment of
* 90/127 degrees.  However, 0 represents 0 degrees to 45/127 degrees, and 64
* represents exactly 45 degrees; i.e. This function returns 64 when X == Y.
*
*******************************************************************************/
static uint32_t Cy_CapSense_Gesture_ArcTanOctant(uint32_t x, uint32_t y)
{
    int32_t savedAngle = -CY_CAPSENSE_GESTURE_ARCTAN_COEFF_A;
    uint32_t scaledInputRatio;
    
    scaledInputRatio = (y << 8u) / x;
    
    savedAngle += CY_CAPSENSE_GESTURE_ARCTAN_COEFF_B * scaledInputRatio;
    savedAngle -= CY_CAPSENSE_GESTURE_ARCTAN_COEFF_C * scaledInputRatio * scaledInputRatio;
    
    return (((uint32_t)((savedAngle * 45) >> 23)) & 0x000001FFu);
}

/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_GetAngle
****************************************************************************//**
*  
* Calculates the angle associated with an X value and a Y value.
*
* \param x
* X value.
*
* \param y
* Y value.
*
* \return
* Returns calculated angle.
*
*******************************************************************************/
static int32_t Cy_CapSense_Gesture_GetAngle(uint32_t deltaX, uint32_t deltaY)
{
    int32_t angle;

    /* Determine the absolute value of the angle */
    if (deltaY <= deltaX)
    {
        /*
         * Angle is within 1 octant of the Y axis.  X is non-zero.  Therefore, Y
         * must be non-zero, so there will be no division by zero here.
         */
        angle = (int32_t)Cy_CapSense_Gesture_ArcTanOctant(deltaX, deltaY);
    }
    else /* (deltaY > deltaX) */
    {
        /*
         * Angle is more than 1 octant from the Y axis. absX is non-zero, so
         * there will be no division by zero here.
         */
        angle = 90 - (int32_t)Cy_CapSense_Gesture_ArcTanOctant(deltaY, deltaX);
    }
    return angle;
}

/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_CheckAngleWithinThresh
****************************************************************************//**
*
* Checks if an angle is within a threshold.
*
* \param config
* The pointer to the gesture configuration structure 
* \ref cy_stc_capsense_gesture_config_t.
*
* \param context
* The pointer to the gesture context structure 
* \ref cy_stc_capsense_gesture_context_t.
*
* \return
* Returns non-zero value if displacement is within the specified threshold.
*
*******************************************************************************/
static uint32_t Cy_CapSense_Gesture_CheckAngleWithinThresh(
                const cy_stc_capsense_gesture_config_t * config, 
                cy_stc_capsense_gesture_context_t * context)
{
    uint32_t deltaOpp; /* Opposite side */
    uint32_t deltaAdj; /* Adjacent side */
    uint32_t angle = 0u;
    uint32_t status = 0u;
    
