dustin-crossman/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6mw/capsense/lib/cy_capsense_gesture_lib.c
    cy_stc_capsense_ofes_context_t * cxt = &context->ofesContext;
    uint32_t edgeType = cxt->edge;
    
    if ((edgeType == CY_CAPSENSE_GESTURE_DIRECTION_LEFT) || (edgeType == CY_CAPSENSE_GESTURE_DIRECTION_RIGHT))
    {
        deltaOpp = ABS_DIFF(context->position1.y, cxt->touchStartPosition1.y);
        deltaAdj = ABS_DIFF(context->position1.x, cxt->touchStartPosition1.x);
    }
    else /* ((edgeType == CY_CAPSENSE_GESTURE_DIRECTION_UP) || (edgeType == CY_CAPSENSE_GESTURE_DIRECTION_DOWN)) */
    {
        deltaOpp = ABS_DIFF(context->position1.x, cxt->touchStartPosition1.x);
        deltaAdj = ABS_DIFF(context->position1.y, cxt->touchStartPosition1.y);
    }

    if (deltaAdj >= config->edgeDistanceMin)
    {
        /* Prevent crash: 0 in denominator */
        if (deltaAdj != 0u)
        {
            if (deltaOpp != 0u)
            {
                angle = Cy_CapSense_Gesture_GetAngle(deltaAdj, deltaOpp);
            }
            if (angle <= config->edgeAngleMax)
            {
                status = 1u;
            }
            else
            {
                status = CY_CAPSENSE_GESTURE_DIRECTION_UNKNOWN;
            }
        }
        else
        {
            status = CY_CAPSENSE_GESTURE_DIRECTION_UNKNOWN;
        }
    }

    return status;
}


/*******************************************************************************
* Function Name: Cy_CapSense_Gesture_CheckDisplacement
****************************************************************************//**
*
* Checks if movement is within a thresholds.
*
* \param threshold
* Specifies the movement threshold.
*
* \param pos1
* Pointer to the current touch position structure 
* \ref cy_stc_capsense_gesture_position_t.
*
* \param pos2
* Pointer to the previous touch position structure 
* \ref cy_stc_capsense_gesture_position_t.
*
* \return
* Returns non-zero value if displacement is within the specified threshold.
*
*******************************************************************************/
static uint32_t Cy_CapSense_Gesture_CheckDisplacement(
                uint32_t threshold,
                cy_stc_capsense_gesture_position_t * pos1,
                cy_stc_capsense_gesture_position_t * pos2)
{
    uint32_t status = 0u;
    uint32_t displacementX = ABS_DIFF(pos1->x, pos2->x);
    uint32_t displacementY = ABS_DIFF(pos1->y, pos2->y);
    
    if ((threshold >= displacementX) && (threshold >= displacementY))
    {
        status = 1u;
    }

    return status;
}


/* [] END OF FILE */
